<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [

//    'type'	=>	'file',
//    // 全局缓存有效期（0为永久有效）
//    'expire'=>  3600,
//    // 缓存前缀
//    'prefix'=>  'wf_',
//    // 缓存目录
//    'path'  =>  '../runtime/cache/',

    // 改缓存配置为复合类型
    'type'  =>  'complex',
    'default'	=>	[
        'type'	=>	'file',
        // 全局缓存有效期（0为永久有效）
        'expire'=>  3600,
        // 缓存前缀
        'prefix'=>  'wf_',
        // 缓存目录
        'path'  =>  '../runtime/cache/',
    ],
    'redis'	=>	[
        'type'	=>	'redis',
        'host'	=>	'cacheserver',
        'port'  =>  6379,
        'password' => '',
        // 全局缓存有效期（0为永久有效）
        'expire'=>  3600,
        // 缓存前缀
        'prefix'=>  'wf_',
    ],
    // 添加更多的缓存类型设置
];
